// components/NationalParksInfo.js

import React from "react";

const NationalParksInfo = () => {
  return (
    <div className="container">
      <div className="left-column">
        <h1 className="heading">Національні парки та заповідники України🌲</h1>
        <p className="paragraph">
          Вітаємо на сайті національних природних парків України –
          nationalparks.in.ua. На сьогодні це найповніший та найзручніший
          інтернет-проєкт, присвячений популяризації зеленого й екологічного
          туризму на природоохоронних територіях України.
        </p>
        <p className="paragraph">
          У всьому світі національні природні парки мають велику популярність
          серед місцевого населення, а деякі з них набули всесвітньої слави
          (Біловезька Пуща, Єллоустоун).
        </p>
        <p className="paragraph">
          Україна також має чим похизуватися, у нас налічується 53 національних
          природних парки, 19 природних та 5 біосферних заповідників. Крім
          цього, існують регіональні природні парки й заказники різного рівня.
        </p>
        <p className="paragraph">
          Останніми роками в Україні зростає зацікавленість природними парками
          та заповідниками. Збільшується кількість садиб зеленого туризму,
          організовуються майстер-класи, спортивні змагання, фестивалі,
          освітньо-екологічні заходи.
        </p>
        <p className="paragraph">
          Це чудовий сигнал для розвитку внутрішнього рекреаційного туризму.
          Приємно усвідомлювати, що й наш ресурс є частинкою цього важливого
          процесу.
        </p>
      </div>
    </div>
  );
};

export default NationalParksInfo;
