// pages/api/regions.js

export default function handler(req, res) {
  const { label, id } = req.query;

  // Logic to fetch data based on label and id
  // For demonstration purposes, let's assume you have some data stored somewhere
  // and you fetch it based on label and id
  const data = fetchData(label, id);

  // Check if data exists
  if (data) {
    res.status(200).json(data);
  } else {
    res.status(404).json({ error: "Data not found" });
  }
}

function fetchData(label, id) {
  const regionsData = {
    zakarpattia: [
      {
        id: 1,
        content: {
          region: "Закарпаття",
          title: "Зачарований край",
          image:
            "https://zacharovanyikrai-park.in.ua/wp-content/uploads/2022/12/NPP-Zacharovanyy-kray.jpg",

          paragraphs: [
            "Національний природний парк “Зачарований край” розташований на Закарпатті неподалік від містечка Іршава. Його створили у 2009 році для збереження, відтворення й ефективного використання типових та унікальних природних комплексів Східних Карпат, що мають важливе природоохоронне, естетичне, наукове, освітнє, рекреаційне й оздоровче значення.",
            "Назва парку “Зачарований край” говорить за себе сама. Місцевість надзвичайно мальовнича й приваблива як природними, так і культурно-історичними об’єктами. Парк займає територію низькогір’я вулканічного походження із середніми висотами 500–600 метрів. Особливістю місцевих гір є те, що схили дуже круті й важкодоступні, а тому не заселені. Це допомогло зберегти природу в практично первісному стані. Територія парку здебільшого вкрита густими лісами. Переважають дубові, дубово-грабові й букові деревостани, останні у 2017 році були включені до світової спадщини ЮНЕСКО.",
            "На висоті 820–860 метрів над рівнем моря лежить унікальне сфагнове болото Чорне Багно, яке вважається найглибшим торфовим болотом в Українських Карпатах. Глибина, за різними даними, складає 6–7 метрів. На болоті росте чимало рідкісних рослин: журавлина болотна і дрібноплідна, росичка круглолиста, сашник іржавий та інші.",
            "У межах парку трапляється велика кількість хребетних тварин, серед них: олень благородний, борсук, козуля, свиня дика, лисиця, бурий ведмідь, рись. Із фауни парку до Червоної книги України занесено 32 види, до Європейського червоного списку – 11.",
            "Національний парк “Зачарований край” – надзвичайно мальовниче місце для спокійного відпочинку в гармонії з природою. Чудові поєднання старовікового лісу з невеликими горами та чудернацькими скелями, чистою водою гірських струмків і закарпатською гостинністю неодмінно зачарують вас.",
          ],
        },
      },
      {
        id: 2,
        content: {
          region: "Закарпаття",
          title: "Синевир",
          image:
            "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d0/%D0%9F%D1%80%D0%BE%D1%81%D1%82%D0%BE%D1%80%D0%B8_%D0%A1%D0%B8%D0%BD%D0%B5%D0%B2%D0%B8%D1%80%D1%83.jpg/640px-%D0%9F%D1%80%D0%BE%D1%81%D1%82%D0%BE%D1%80%D0%B8_%D0%A1%D0%B8%D0%BD%D0%B5%D0%B2%D0%B8%D1%80%D1%83.jpg",
          paragraphs: [
            "Національний природний парк “Синевир” розташований у Міжгірському районі Закарпатської області, а його адміністративний центр – у селі Синевир-Остріки. Створений у 1989 році на базі ландшафтного заказника “Синевирське озеро”.",
            "Озеро Синевир є найбільшим у Карпатах та одним з найвідоміших туристичних об’єктів України. Щороку сюди приїздить багато відвідувачів з різних куточків України та з-за кордону. Усіх їх приваблює неповторна краса гірського озера, що сховалося серед ялинових лісів. Завдяки естетичній природі Синевир привертає увагу художників, фотографів, кінорежисерів. Саме тут знімали українську стрічку жахів “Синевир”, а на початку 2018 року – фільм “Останній крок” за участі Жана Рено.",
            "На території національного парку є ще одне гірське озеро під назвою Озірце. Воно менше за площею, але теж дуже мальовниче.",
            "Природа парку “Синевир” різноманітна. Тут налічується 914 видів рослин (40 червонокнижних) і 236 видів тварин (22 червонокнижні). На території парку діє перший і найбільший в Україні центр реабілітації бурих ведмедів.",
            "Парк має хорошу інфраструктуру для відпочинку й рекреації. Поряд працює чимало готелів і садиб зеленого туризму, є облаштовані місця для наметів. Серед найпопулярніших розваг: прогулянки на конях, походи в гори, збирання білих грибів і ягід, катання на велосипедах. Цікавими об’єктами є музей лісосплаву та музей просто неба “Старе село”, а також традиційні дерев’яні церкви в навколишніх селах.",
            "Чисте гірське повітря, зелені ліси, неповторна краса ландшафтів і навіть більше – усе це чекає на вас у національному парку “Синевир”.",
          ],
        },
      },
      {
        id: 3,
        content: {
          region: "Закарпаття",
          title: "Ужанський",
          image:
            "https://upload.wikimedia.org/wikipedia/commons/9/93/Uzhanskyi_NPP.jpg",
          paragraphs: [
            "Ужанський національний природний парк розташований на Закарпатті біля селища Великий Березний, яке і є його центром. Парк був заснований у 1999 році для збереження, відтворення й раціонального використання типових та унікальних природних комплексів Східних Карпат, що мають важливе рекреаційне, наукове, естетичне, освітнє й оздоровче значення.",
            ,
            "Це територія з давніми природоохоронними традиціями, адже ще за часів Австро-Угорщини тут були створені резервати для охорони пралісів. Ужанський НПП увійшов до складу першого у світі тристороннього українсько-польсько-словацького міжнародного біосферного резервату “Східні Карпати”.",
            ,
            "Природне багатство нацпарку справді вражає: унікальні букові, яворові та ялицеві праліси, джерела мінеральних вод, карстові печери й навіть місце падіння метеорита. Флора парку нараховує майже 900 видів вищих судинних рослин, більш ніж 300 лишайників і понад 140 мохоподібних. Фауна парку представлена 522 видами тварин. Серед них ведмідь бурий, вовк, олень благородний, кабан, куниця кам’яна. У пралісах трапляються такі рідкісні види, як рись і кіт лісовий. Описана чисельність птахів становить 111 видів, з яких 12 занесено до Червоної книги України (сова довгохвоста, лелека чорний, голуб-синяк).",
            ,
            "Букове криволісся – одна з природних перлин парку. На площі 55 га буки згинаються і стелються стовбуром по землі, а їхні гілки вкорінюються й дають життя молодим деревам. В Ужанському нацпарку ростуть найстаріші дуби України: Дідо-дуб і Чемпіон. Їхній приблизний вік – 1300 років.          ",
            ,
            "Місцевість багата не тільки природною, але й культурною спадщиною. Насамперед увагу привертають давні дерев’яні храми в лемківському й бойківському стилях, що розкинулися територією парку. Найдавніші з них були зведені в середині XVII століття і є справжніми шедеврами народної архітектури. Найвідоміші з них: церква Покрови Пресвятої Богородиці в селі Кострина (1645 р.) і церква святого Михайла в селі Ужок, внесена до світової спадщини ЮНЕСКО.",
            ,
            "Ужанський національний парк – це чудове місце для зеленого туризму, туристичних походів, знайомства з природою, а також духовного й культурного просвітництва. Колорит, історія та сакральність краю в поєднанні з неймовірною природою чекають саме на вас.",
          ],
        },
      },
    ],
    volyn: [
      {
        id: 1,
        content: {
          region: "Волинь",
          title: "Прип’ять-Стохід",
          image:
            "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d8/%D0%9F%D1%80%D0%B8%D0%BF%27%D1%8F%D1%82%D1%8C-%D0%A1%D1%82%D0%BE%D1%85%D1%96%D0%B4_%D0%BD%D0%B0_%D1%81%D0%B2%D1%96%D1%82%D0%B0%D0%BD%D0%BA%D1%83.jpg/800px-%D0%9F%D1%80%D0%B8%D0%BF%27%D1%8F%D1%82%D1%8C-%D0%A1%D1%82%D0%BE%D1%85%D1%96%D0%B4_%D0%BD%D0%B0_%D1%81%D0%B2%D1%96%D1%82%D0%B0%D0%BD%D0%BA%D1%83.jpg",

          paragraphs: [
            "Національний природний парк “Прип’ять-Стохід” розташований у північній частині Волинської області й частково межує з Білоруссю. Його створили у 2007 році на базі регіонального ландшафтного парку “Прип’ять-Стохід”. Мета заснування – збереження, відтворення та раціональне використання природних комплексів Полісся, відродження занепалих видів господарювання, підняття рівня екологічної свідомості серед населення.",
            "“Прип’ять-Стохід” – місце неземної краси з незайманою природою й автентичністю поліського краю. Природоохоронна територія включає заплави річок Прип’ять і Стохід, визнані Рамсарською конвенцією водно-болотними угіддями міжнародного значення. Територію національного парку часто називають “українською Амазонкою”, адже заплави тутешніх річок мають безліч рукавів, стариць та озер.",
            "Флора надзвичайно багата. Через високий рівень води рослинний світ складають переважно гідрофільні (здатні до запилення під водою) види. Значну частину парку займають ліси (35%), що здебільшого представлені сосною, вільхою та березою, подекуди дубом.",
            "Серед фауни парку переважають птахи: чапля сіра, крижень, гуска сіра. З червонокнижних видів: скопа, лелека чорний, орлан-білохвіст, змієїд, журавель сірий. Лише тут в Україні зафіксоване гніздування синиці білої, яка є символом парку. Тут проходить сезонна міграція птахів, у цей час їхня кількість може сягати 150 тис. особин. У лісі трапляється дикий кабан, лось, заєць, борсук.",
            "У національному парку створені чудові умови для зеленого туризму й активного відпочинку. Є обладнані туристичні маршрути й місця для стоянок, гостьовий будинок для туристів, прокат байдарок.",
            "“Прип’ять-Стохід” – незвичайний національний парк, адже більшу частину території складають болота, річки, озера (разом 49%). Це одне з найкращих місць в Україні для спостереження за птахами. Улітку на території парку відбуваються змагання з екстремального водного туризму – “Поліська регата”.",
          ],
        },
      },
      {
        id: 2,
        content: {
          region: "Волинь",
          title: "Шацький",
          image:
            "https://etnotur.ua/wp-content/uploads/2016/04/SHatskij-natsionalnyj-prirodnyj-park.jpg",

          paragraphs: [
            "Шацький національний природний парк розташований на північному заході Волинської області і є одним з найстаріших в Україні. Був створений у 1983 році для збереження унікальних природних комплексів Шацьких озер.",
            "Парк лежить у природній зоні Північного Полісся з характерним вологим кліматом і досить високою заболоченістю. Шацький НПП об’єднав у собі систему 23 природних озер. Безсумнівно, найвідомішим об’єктом парку є озеро Світязь, що має найбільший розмір і глибину. Усі озера належать до водозбору річки Західний Буг, а значить, і до басейну Балтійського моря.",
            "Шацький національний парк є одним з найбільш відвідуваних в Україні. Улітку сюди приїздить безліч туристів з різних куточків України та з-за кордону. Озера ваблять людей чистою лікувальною водою зі сріблом і гліцерином.",
            "Крім водних об’єктів, нацпарк має значні лісові масиви (близько половини території), більшість із них сформована сосною. На болотистих ділянках зростають вільшаники. У літній сезон ліси приваблюють туристів і місцевих жителів великим урожаєм ягід і грибів.",
            "Флора парку представлена 795 видами вищих судинних рослин. 28 видів занесено до Червоної книги України, зокрема береза низька, росичка середня, любка дволиста, товстянка звичайна та інші.",
            "Фауна налічує понад 300 видів. Ссавців – 55, птахів – 241, риб – 30. До Червоної книги України занесено 37 видів. У Шацьких озерах живе рідкісний вид риб – вугор європейський.",
            "З 2002 року частину парку включено до біосферного резервату “Західне Полісся” під егідою ЮНЕСКО. До резервату також увійшли природоохоронні території Білорусі й Польщі.",
            "Шацький національний парк – це, без перебільшення, перлина поліської природи. Кришталево чиста вода, зелені ліси й луки, цікаві етнографічні об’єкти та багато іншого вже чекають на вас.",
          ],
        },
      },
    ],
    zaporizhzhia: [
      {
        id: 1,
        content: {
          region: "Запоріжжя",
          title: "Великий Луг",
          image:
            "https://static.ukrinform.com/photos/2023_06/thumb_files/630_360_1686578377-843.png",

          paragraphs: [
            "Національний природний парк “Великий Луг” розташований у Запорізькій області з адмінцентром у Дніпрорудному. Парк був заснований у 2006 році для збереження, відтворення й раціонального використання типових і унікальних природно-ландшафтних та історико-культурних комплексів степової зони, що мають важливе природоохоронне, наукове, естетичне, рекреаційне й оздоровче значення.",
            "Національний парк створили на залишках історичної місцевості – прадавніх плавнів Дніпра, що мали площу близько 400 км². У 50-х роках минулого століття під час будівництва Каховського водосховища всю цю територію затопили.",
            "НПП “Великий Луг” включає видовжену лінію берегів водосховища, балки та острови (останні утворилися після затоплення). Тут збереглося чудове видове різноманіття й багато історичних артефактів.",
            "Балки та береги вкриті унікальним поєднанням степової, лісової, болотної й лучної рослинності. На території парку зареєстровано 18 червонокнижних видів рослин. Фауна найкраще представлена птахами, яких тут налічується понад 200 видів. З них 35 занесено до Червоної книги України (орлан-білохвіст, пугач, качка сіра, коровайка, кулик-сорока та інші).",
            "Надзвичайну цінність мають археологічні й історичні пам’ятки. Місцевість теперішнього нацпарку була заселена з доісторичних часів. Виявлені залишки стоянок первісних людей, давні городища й могильники, сліди трипільської культури, скіфської та сарматської доби. Пізніше ця територія належала до Запорізької Січі, про що збереглося чимало свідчень і матеріальних пам’яток.",
            "Великий Луг – привабливе місце не тільки з погляду ландшафтів та біорізноманіття, але і як сакральна історична місцевість.",
          ],
        },
      },
    ],
    ivano_frankivsk: [
      {
        id: 1,
        content: {
          region: "Івано-Франківськ",
          title: "Верховинський",
          image:
            "https://upload.wikimedia.org/wikipedia/commons/f/fb/%D0%94%D0%BE%D1%80%D0%BE%D0%B3%D0%B0_%D1%83_%D0%91%D1%83%D1%80%D0%BA%D1%83%D1%82.jpg",

          paragraphs: [
            "Національний природний парк “Великий Луг” розташований у Запорізькій області з адмінцентром у Дніпрорудному. Парк був заснований у 2006 році для збереження, відтворення й раціонального використання типових і унікальних природно-ландшафтних та історико-культурних комплексів степової зони, що мають важливе природоохоронне, наукове, естетичне, рекреаційне й оздоровче значення.",
            "Національний парк створили на залишках історичної місцевості – прадавніх плавнів Дніпра, що мали площу близько 400 км². У 50-х роках минулого століття під час будівництва Каховського водосховища всю цю територію затопили.",
            "НПП “Великий Луг” включає видовжену лінію берегів водосховища, балки та острови (останні утворилися після затоплення). Тут збереглося чудове видове різноманіття й багато історичних артефактів.",
            "Балки та береги вкриті унікальним поєднанням степової, лісової, болотної й лучної рослинності. На території парку зареєстровано 18 червонокнижних видів рослин. Фауна найкраще представлена птахами, яких тут налічується понад 200 видів. З них 35 занесено до Червоної книги України (орлан-білохвіст, пугач, качка сіра, коровайка, кулик-сорока та інші).",
            "Надзвичайну цінність мають археологічні й історичні пам’ятки. Місцевість теперішнього нацпарку була заселена з доісторичних часів. Виявлені залишки стоянок первісних людей, давні городища й могильники, сліди трипільської культури, скіфської та сарматської доби. Пізніше ця територія належала до Запорізької Січі, про що збереглося чимало свідчень і матеріальних пам’яток.",
            "Великий Луг – привабливе місце не тільки з погляду ландшафтів та біорізноманіття, але і як сакральна історична місцевість.",
            "Верховинський національний природний парк з центром у селі Верхній Ясенів (присілок Печіще) розташований на Івано-Франківщині. Парк створили у 2010 році для збереження біорізноманіття й цілісності природних комплексів Чивчинських і Гринявських гір.",
            "Їхня краса й унікальність приваблює людей вже впродовж багатьох десятиліть. Статус заповідної території цим місцям намагалися надати ще в 30-х роках минулого століття. Проте перші кроки для збереження природи вдалося зробити тільки в 60-х роках. Наразі парк входить до переліку молодих національних парків України з хорошим потенціалом для розширення.",
            "Територія парку лежить у верхів’ях Білого та Чорного Черемошу. Це досить віддалені й важкодоступні місця Карпатських гір. Нацпарк славиться мальовничою природою та культурно-етнічними надбаннями гуцулів. Місцеві жителі є носіями давніх традицій і промислів (ткацтва, різьбярства, сироваріння та інших).",
            "Верховинський нацпарк розташований у перехідній кліматичній зоні від теплого західноєвропейського до холодного східноєвропейського. Літо на цій території тепле й довге, але з великою кількістю опадів. Тут протікають дві великі річки: Білий і Чорний Черемош.",
            "Переважна частина парку вкрита лісами, домінантним видом яких є ялина. На терасах річок поширені вільхові деревостани. Загалом флора парку представлена 700 видами вищих судинних рослин, з них 59 занесені до Червоної книги України (айстра альпійська, аконіт Жакена, костриця Порціуса тощо).",
            "Тут живе чимало рідкісних тварин, зокрема ведмідь бурий, рись, кіт лісовий, лосось дунайський, саламандра плямиста, тетерук, сичик-горобець та інші.",
            "Однією з родзинок Верховинського парку є залишки кляуз, тобто гідротехнічних споруд (гребель), за допомогою яких накопичували воду і сплавляли ліс гірськими річками. Зокрема частково збереглися кляузи Лостун і Перкалаб. Останні сплави лісу таким способом датуються 1970-ми роками.",
            "Національний природний парк “Верховинський” – один із небагатьох куточків Карпат та України загалом, де можна відшукати справді первозданну природу, поринути у світ традицій наших предків, наповнитися природними силами й відчути себе вільним від міста.",
          ],
        },
      },
      {
        id: 2,
        content: {
          region: "Івано-Франківськ",
          title: "Гуцульщина",
          image:
            "https://upload.wikimedia.org/wikipedia/commons/c/c5/Huculsczyna_IF-3.JPG",

          paragraphs: [
            "Національний природний парк “Гуцульщина”, розташований в Івано-Франківській області з центром у Косові, був заснований у 2002 році для відтворення й раціонального використання генетичних ресурсів рослинного і тваринного світу, унікальних природних комплексів та етнокультурного середовища Покутсько-Буковинських Карпат.",
            "Територія, що увійшла до національного парку, надзвичайно цікава. Тут неповторна природна краса поєднується з етнічними та історико-культурними надбаннями гуцулів.",
            "Гірський рельєф парку поділяється на 2 типи: передгірну частину з висотами 350–500 м і Карпатську область, де висоти сягають 1470 м. Гірські хребти Покутських Карпат мають здебільшого пологі схили. Такий рельєф чудово підходить для прогулянок і нескладних походів.",
            "Протяжність території парку із північного заходу на південний схід складає 29 км, а з північного сходу на південний захід – 20. Південна межа парку проходить річкою Черемош, перлиною краю, де можна сплавитися на рафті, порибалити чи просто відпочити.",
            "Значну частину території парку займають ліси, основу яких складають листяні породи. Найчастіше тут трапляється бук, дуб, граб і смерека. Наразі в парку виявлено 874 види вищих судинних рослин, понад 60 видів занесено до Червоної книги України (арніка гірська, шафран Гейфеля, сосна кедрова, тис ягідний та інші).",
            "Тваринний світ парку представлений теж досить широко: понад 50 видів ссавців, близько 172 видів птахів, 14 видів земноводних тощо. Зустрічаються такі рідкісні хижаки, як ведмідь бурий, рись, кіт лісовий.",
            "Крім дикої природи, “Гуцульщина” приваблює туристів колоритом і культурними надбаннями, стародавніми промислами й ремеслами. Одним із них є гуцульська кераміка, що здобула популярність далеко за межами України. Глиняні вироби місцевих майстрів славляться неповторним розписом та унікальною технологією виробництва, яку використовує вже багато поколінь гончарів. В інформаційному центрі нацпарку відкрито кілька кімнат-музеїв, тут експонуються колекції лікарських рослин, геологічних утворень, комах тощо. На території нацпарку працює маєток святого Миколая з музеєм новорічно-різдвяної іграшки.",
            "Національний природний парк “Гуцульщина” – місце, де можна здійснювати свої мрії. Надзвичайна природа в поєднанні з унікальними традиціями краю неодмінно сподобається вам.",
          ],
        },
      },
      {
        id: 3,
        content: {
          region: "Івано-Франківськ",
          title: "Карпатський",
          image:
            "https://upload.wikimedia.org/wikipedia/commons/a/ac/%D0%9A%D0%B0%D1%80%D0%BF%D0%B0%D1%82%D1%81%D1%8C%D0%BA%D0%B8%D0%B9_%D0%BD%D0%B0%D1%86%D1%96%D0%BE%D0%BD%D0%B0%D0%BB%D1%8C%D0%BD%D0%B8%D0%B9_%D0%BF%D1%80%D0%B8%D1%80%D0%BE%D0%B4%D0%BD%D0%B8%D0%B9_%D0%BF%D0%B0%D1%80%D0%BA_%28%D0%B1%D1%96%D0%BB%D1%8F_%D0%93%D0%BE%D0%B2%D0%B5%D1%80%D0%BB%D0%B8%29.jpg",

          paragraphs: [
            "Карпатський національний природний парк в Івано-Франківській області з центром у місті Яремче створили влітку 1980 року для збереження унікальних лісових екосистем у Центральній Європі.",
            "Парк є найвідомішим і найвідвідуванішим в Україні завдяки винятковому розташуванню та концентрації природних об’єктів. До нього входять 2 гірські масиви Карпат: Чорногора та Ґорґани.",
            "На території парку збереглись унікальні лісові масиви, реліктові рослини й рідкісні види тварин.",
            "Червонокнижна флора представлена 80 видами, найвідомішими з яких є рододендрон східнокарпатський (легендарна червона рута), шафран Гейфеля (крокус), арніка гірська.",
            "З рідкісних тварин трапляються рись, кіт лісовий, ведмідь бурий, саламандра плямиста, беркут.",
            "Найпопулярніші туристичні об’єкти парку – гори Говерла та Піп Іван Чорногірський, високогірні озера Несамовите й Марічейка, а також витоки річки Прут.",
            "Карпатський парк має чудову інфраструктуру та широкі можливості для рекреації й активного відпочинку.",
            "Окрім природних багатств, тут зосереджено багато етнографічних, культурних та історичних цікавинок. Розвинута мережа садиб зеленого туризму, розроблені та промарковані туристичні маршрути.",
            "Карпатський національний природний парк – казкове місце з неповторною природою, що приваблює туристів уже понад 100 років. Величні гори, реліктові ліси, швидкі гірські потоки та привітні люди точно не залишать вас байдужими.",
          ],
        },
      },
    ],
    kyiv: [
      {
        id: 1,
        content: {
          region: "Київ",
          title: "Голосіївський",
          image:
            "https://golos.kyivzelenbud.com/wp-content/uploads/sites/4/2017/07/Golosii-vskyy-_park_im._M.Rylskogo_04-800x476.jpg",

          paragraphs: [
            "Національний природний парк “Голосіївський“ розташований на півдні Києва. Парк заснували у 2007 році після майже 20-річної боротьби екологів. В Указі Президента України зазначається, що метою створення парку є збереження природних комплексів Київського Полісся, а також покращення екологічного стану в столиці.",
            "Територія парку належить відразу до двох природних зон: лісостепу на півдні та Київського Полісся на півночі. Через це місцева рослинність досить різноманітна. Близько 90% площі Голосіївського НПП займають ліси, решту – луки, болота й водойми. Загалом флора парку нараховує понад 600 видів вищих судинних рослин. 24 види занесені до Червоної книги України, зокрема сон лучний, ковила дніпровська, півники сибірські, лілія лісова, сальвінія плаваюча та інші. Досить цікавими є насадження буку лісового, які чудово акліматизувались у незвичній для себе місцевості.",
            "Одна з головних окрас парку – вікові дуби, які ростуть майже на всій території. Деяким з них близько 500 років.",
            "Фауна парку представлена 192 видами хребетних тварин і 600 видами безхребетних. З рідкісних червонокнижних видів трапляється мідянка, видра, горностай, махаон, жук-олень, вусач мускусний. Також у парку можна зустріти лося, але він переважно мігрує з інших ділянок.",
            "Не менш цікавими для відвідувачів є історико-культурні об’єкти Голосіївського НПП: Ботанічний сад НУБіП, Національний музей бджільництва України, Головна астрономічна обсерваторія НАН України, Національний музей народної архітектури та побуту України тощо.",
            "Голосіївський національний природний парк – це справжня перлина природи, яка збереглася серед метушливого мегаполісу. Ви неодмінно маєте пройтися зеленим лісом під шелест листя вікових дерев, помилуватися лучними квітами навесні, послухати спів пташок і зануритися в давню історію краю.",
          ],
        },
      },
    ],
    lviv: [
      {
        id: 1,
        content: {
          region: "Львів",
          title: "Сколівські Бескиди",
          image:
            "https://www.ukrwest.com.ua/ckfinder/userfiles/images/blog/zapovidnyk-tustan.jpg",

          paragraphs: [
            "Національний природний парк “Сколівські Бескиди” розташований у північно-східній частині Українських Карпат у межах трьох районів Львівської області з адміністративним центром у місті Сколе. Парк заснували в 1999 році для збереження, відтворення й раціонального використання природних комплексів краю, що мають природоохоронне, естетичне, наукове та рекреаційне значення.",
            "Природа в НПП “Сколівські Бескиди” надзвичайно мальовнича. Пасмо гір з абсолютними висотами 600–1200 м над рівнем моря лежить у басейні річок Стрий та Опір. Найвищою вершиною парку є гора Парашка (1268 м). Також тут течуть 2 невеликі водоспади: Гуркало та Кам’янецький. Навколо смт Східниця зосереджена низка джерел і свердловин з мінеральною водою різних типів (Нафтуся, Боржомі).",
            "Один з найвідоміших об’єктів парку – Державний історико-культурний заповідник “Тустань”. Однойменна наскельна фортеця слугувала оборонним комплексом і митницею в ІХ–ХVІ століттях.",
            "Більшу частину території парку вкривають ліси, з яких 55% складають хвойні породи (смерека), а решту  – листяні (переважно бук). 35 видів рослин занесені до Червоної книги України.",
            "Однією з родзинок парку є зубри, які добре адаптувалися до карпатського клімату й дали потомство. З червонокнижних видів можна зустріти бурого ведмедя, рись, кота лісового, борсука та інших.",
            "На території парку діють локації для зеленого туризму й активного відпочинку: марковані туристичні маршрути, екостежки, обладнані місця для відпочинку, садиби.",
            "“Сколівські Бескиди” – неймовірно красивий парк із цікавою історією та розкішною природою, який завжди чекає на відвідувачів.",
          ],
        },
      },
      {
        id: 2,
        content: {
          region: "Львів",
          title: "Яворівський",
          image: "",

          paragraphs: [
            "Національний природний парк “Яворівський” розташований на заході Львівщини, усього за 25 кілометрів від Львова. Парк заснували влітку 1998 року для збереження, відтворення й раціонального використання типових та унікальних лісостепових ландшафтів у районі Головного європейського вододілу.",
            "Природа національного парку має виняткову красу. Він лежить у межах Східного (Українського) Розточчя, що витягнулося вузьким горбистим пасмом від Львова до польського Красника. Саме в межах Розточчя проходить Головний європейський вододіл, тут беруть початок річки басейнів Чорного й Балтійського морів.",
            "Простори парку характеризуються лісистістю, великою кількістю струмків та озер. Переважають дубово-грабові, дубово-соснові ліси, але трапляються й реліктові ділянки з буком, ялицею та явором. Флора парку нараховує близько 700 видів вищих судинних рослин, з них 18 червонокнижних. Тваринний світ нацпарку представлений 289 видами, з яких до Червоної книги України занесено 34. У тутешніх лісах можна зустріти дику свиню, зайця, сарну європейську, лисицю, уссурійського єнота. З рідкісних видів трапляється чорний лелека, видра річкова, горностай, лось, олень благородний.",
            "Національний парк та його околиці сповнені історичними та культурними об’єктами. Функціонує кілька музеїв,  багато культових споруд, проводяться мистецькі заходи. Неподалік від парку розташований Державний історико-архітектурний заповідник у місті Жовква (налічується понад 50 архітектурних пам’яток). Крім цього, на півдні парк межує з природним заповідником “Розточчя”.",
          ],
        },
      },
    ],
    odesa: [
      {
        id: 1,
        content: {
          region: "Одеса",
          title: "Тузловські лимани",
          image:
            "https://upload.wikimedia.org/wikipedia/commons/4/4b/Alibey_Lagoon.jpg",

          paragraphs: [
            "Національний природний парк “Тузловські лимани” розташований на півдні Одеської області. Його заснували у 2010 році для збереження цінних природних та історико-культурних комплексів, а також об’єктів Північного Причорномор’я.",
            "Нацпарк лежить у межиріччі Дунаю та Дністра і являє собою групу витягнутих уздовж морського узбережжя мілководних лиманів. Усі вони відділені від моря вузьким (від 50 до 400 м) піщаним пересипом (косою), що має довжину близько 40 км.",
            "Територія характеризується незвичним геологічним ландшафтом і рослинністю. Висота материкових берегів коливається від 2 до 18 метрів і має обривистий характер. Рослинність парку складають переважно трави (понад 80%), загалом на території зареєстровано 507 видів вищих судинних рослин.",
            "Фауна парку найкраще представлена птахами, адже тут проходить один з найбільших міграційних шляхів. Лимани є місцем зимування, гніздування й відпочинку для багатьох видів пернатих. У НПП “Тузловські лимани” зафіксовано 254 види птахів, що становить близько 60% усіх видів України. З них 54 види занесені до Червоної книги України або до інших охоронних списків. Наймасовішими видами на гніздуванні є мартин жовтоногий, крячок рябодзьобий і річковий: в окремі роки їхня чисельність може перевищувати 20 тисяч особин.",
            "Тузловські лимани – одне з найкращих місць для бьордвочингу, дикого морського відпочинку, лікування грязями з лиманів. Це морські пейзажі, неймовірна кількість різнобарвних птахів, простір і відсутність урбанізації.",
          ],
        },
      },
    ],
    rivne: [
      {
        id: 1,
        content: {
          region: "Рівне",
          title: "Дермансько-острозький",
          image:
            "https://upload.wikimedia.org/wikipedia/commons/b/bb/%D0%9E%D0%BA%D0%BE%D0%BB%D0%B8%D1%86%D1%96_%D1%81%D0%B5%D0%BB%D0%B0_%D0%91%D1%83%D1%89%D0%B0.jpg",

          paragraphs: [
            "Дермансько-Острозький національний природний парк, розташований у Здолбунівському й Острозькому районах Рівненської області, заснували у 2009 році для збереження цінних природних територій та історико-культурних об’єктів краю.",
            "Національний парк лежить у надзвичайно мальовничій місцевості, де поєдналися ландшафти Полісся та лісостепу. Між живописними пагорбами Мізоцького кряжу й Кременецьких гір протікає невеличка річка Збитинка. Улітку місцевість просто потопає в зелені й зачаровує краєвидами.",
            "Завдяки унікальному розташуванню й кліматичним умовам тут збереглося велике біорізноманіття. У Дермансько-Острозькому парку налічується 49 видів рослин і 52 види тварин, занесених до Червоної книги України.",
            "На території нацпарку й біля нього зосереджена неабияка кількість історичних і культурних об’єктів, зокрема Державний історико-культурний заповідник міста Острог, руїни Новомалинського замку, Дубненський замок, археологічні пам’ятки трипільської культури.",
            "У селах Новомалин та Буща проходять етнофестивалі “Новомалинська Любава” і “Буща Папороть”. На третій день Великодня в селі Гурби відзначають річницю боїв між УПА та НКВС, що відбувались у квітні 1944 року.",
            "Дермансько-Острозький національний парк – ідеальне місце для зеленого туризму, піших і велосипедних походів, сімейного відпочинку на природі. Виняткова природа та історія краю залишаться у вашій пам’яті назавжди.",
          ],
        },
      },
    ],
    sumy: [
      {
        id: 1,
        content: {
          region: "Сумська",
          title: "Деснянсько-Старогутський",
          image:
            "https://upload.wikimedia.org/wikipedia/commons/5/5a/Desna6.JPG",

          paragraphs: [
            "Національний природний парк “Деснянсько-Старогутський” розкинувся далеко на півночі Сумської області. Парк було створено в 1999 році для збереження, відтворення, а також раціонального використання природних ландшафтів Лівобережного Полісся. Адміністративний центр розташований у місті Середина-Буда.",
            "Парк складається з 2 віддалених одна від одної частин: Придеснянської та Старогутської.",
            "Придеснянська частина парку являє собою заплаву річки Десна з притоками. Це одне з найкраще збережених місць такого типу в Україні. У цій частині багато озер, стариць, боліт і, відповідно, широке розмаїття видів. Саме тут відбувається міграція птахів, яку можна спостерігати навесні й восени.",
            "Старогутська частина парку має дещо інший вигляд. Це по-справжньому густий віковий ліс на кордоні з Росією (є південним продовженням Брянських лісів). Таких лісових масивів на Поліссі практично не залишилося. Старогутська частина слугує південною межею для багатьох видів північної фауни: бурого ведмедя, рисі, сичика-горобця та інших.",
            "На території парку трапляється багато червонокнижних видів рослин (22) і тварин (35). У 2009 році був створений Деснянський біосферний резерват, що входить до міжнародної спадщини ЮНЕСКО.",
            "Деснянсько-Старогутський національний природний парк – це справді віддалений куточок, де природа збереглась у незайманому вигляді. Потрапити сюди – значить опинитися поза часом. Хоч і доїхати сюди нелегко, та, побувавши одного разу, точно захочеться повернутися знову.",
          ],
        },
      },
    ],
    ternopil: [
      {
        id: 1,
        content: {
          region: "Тернопільська",
          title: "Кременецькі гори",
          image:
            "https://upload.wikimedia.org/wikipedia/commons/5/55/Kremenec_02.jpg",

          paragraphs: [
            "Національний природний парк “Кременецькі гори” розташований у Кременецькому та Шумському районах Тернопільської області. Був створений у 2009 році для збереження природних та історико-культурних комплексів краю.",
            "Кременецькі гори являють собою частину витягнутої гряди, що простягнулась із заходу на схід. Її довжина в межах нацпарку – близько 40 км, а середня висота коливається від 350 до 400 метрів. Практично весь кряж укритий лісами різного типу, трапляються цінні старовікові ділянки з буком, дубом і грабом.",
            "Ландшафт національного парку надзвичайно мальовничий та естетичний. З вершин кряжу можна милуватися панорамними краєвидами. Через географічне розташування місцевий клімат має сезонні відмінності. Узимку він порівняно теплий з частими відлигами, а влітку, навпаки, прохолодний.",
            "У парку “Кременецькі гори” трапляється багато унікальних видів рослин, частина з яких росте лише тут (береза клокова, сонцесвіт сивий). З представників фауни можна зустріти борсука, пугача, козулю, лисицю, дику свиню, чорного лелеку та інших.",
            "Окрему цінність мають історично-культурні об’єкти Кременця: руїни замку, культові споруди, ботанічний сад, музеї.",
            "Кременецькі гори – чудове місце для різних видів активного відпочинку: велоспорту, походів, спортивного орієнтування, скелелазіння. Узимку тут є де покататися на лижах і санях. Місцеві ліси багаті на гриби та ягоди, є природні джерела води. Відкриті галявини і ліси якнайкраще підходять для відпочинку з наметами.",
          ],
        },
      },
    ],
    kharkiv: [
      {
        id: 1,
        content: {
          region: "Харків",
          title: "Гомільшанські ліси",
          image:
            "https://upload.wikimedia.org/wikipedia/commons/6/66/%D0%93%D0%BE%D0%BC%D1%96%D0%BB%D1%8C%D1%88%D0%B0%D0%BD%D1%81%D1%8C%D0%BA%D1%96_%D0%BB%D1%96%D1%81%D0%B8.jpg",

          paragraphs: [
            "Національний природний парк “Гомільшанські ліси” розташований у центрі Харківської області – у селі Коропове Зміївського району. Парк був заснований у 2004 році для збереження, відтворення й раціонального використання типових та унікальних лісостепових природних комплексів долини річки Сіверський Донець.",
            "Місцевість парку зачаровує красою і справедливо вважається однією з наймальовничіших на Лівобережжі. “Гомільшанські ліси” охоплюють обидва береги Сіверського Дінця і його правої притоки Гомільші. Уся територія вкрита суцільним лісовим масивом. На правому березі Сіверського Дінця переважають широколистяні види дерев (клен, ясен, липа), а на лівому – соснові бори. Є добре збережені старовікові діброви віком до 150 років, а поодиноким дубам по 350 років.",
            "У парку розташоване мальовниче лісове озеро Біле завдовжки близько 1 км і завширшки 150–250 метрів. Найвища точка “Гомільшанських лісів” – Козача гора, звідки відкривається дивовижна панорама на Сіверський Донець.",
            "У НПП “Гомільшанські ліси” можна зустріти багатьох рідкісних птахів (орлана-білохвоста, скопу, сірого журавля) та інших тварин (лося, річкову видру, європейську норку, борсука).",
            "Національний парк приховує й деякі археологічні артефакти: залишки Коропівського та Сухогомільшанського городищ, руїни Преображенського (Миколаївського) монастиря, заснованого близько 1648 року козаками.",
            "Парк має хороші можливості для рекреації та відпочинку. Є садиби для туристів, обладнані місця для кемпінгу, прокат спорядження, марковані маршрути.",
            "“Гомільшанські ліси” – неповторне місце з яскравим поєднанням природного ландшафту й історичних пам’яток. Сюди варто їхати по лісову тишу, відчуття природної гармонії та збагачення власного культурного світогляду.",
          ],
        },
      },
      {
        id: 2,
        content: {
          region: "Харків",
          title: "Слобожанський",
          image:
            "https://upload.wikimedia.org/wikipedia/commons/1/17/%D0%91%D0%BE%D0%BB%D0%BE%D1%82%D0%BE%2C_%D0%9D%D0%9F%D0%9F_%22%D0%A1%D0%BB%D0%BE%D0%B1%D0%BE%D0%B6%D0%B0%D0%BD%D1%81%D1%8C%D0%BA%D0%B8%D0%B9%22.jpg",
          paragraphs: [
            "Національний природний парк “Слобожанський” розташований на північному заході Харківської області з центром у Краснокутську. Був заснований узимку 2009 року для збереження та відтворення унікальних природних систем Слобожанщини.",
            "Слобожанський нацпарк відомий різноманіттям ландшафтів, які поєднують природні зони Полісся й лісостепу. Більшу частину парку займають ліси (близько 90%): дуб, береза, сосна, вільха. Проте головною цінністю парку є осоково-сфагнові та гіпсово-сфагнові болота, які типові для Полісся та рідкісні для Харківщини. Слобожанський нацпарк – це південно-східна межа поширення таких природних екосистем.",
            "Територією парку протікають 2 річки: Мерла і її притока Мерчик. Флора представлена лучною, степовою та болотною рослинністю. З рідкісних рослин можна знайти цибулю ведмежу, сон лучний, любку дволисту. Цікавим видом є росичка круглолиста – комахоїдна рослина, що зростає на болотах.",
            "Типовими мешканцями парку є свиня дика, бобер (символ парку), борсук, лисиця. 38 видів занесено до Червоної книги України: гадюка Нікольського, горностай, орлан-білохвіст, шуліка чорний та інші.",
            "Слобожанський нацпарк славиться не тільки мальовничою природою, а ще й історично-культурними пам’ятками. Поблизу парку розташовані кілька селищ і курганів скіфського та старослов’янського походження. У Краснокутську працює один із найстаріших дендропарків України, який був закладений архітектором Іваном Каразіним орієнтовно в 1793 році. Біля околиць парку (с. Шарівка) розташований відомий палацово-парковий комплекс магната Леопольда Кеніга.",
          ],
        },
      },
    ],
    kherson: [
      {
        id: 1,
        content: {
          region: "Херсонська",
          title: "Джарилгацький",
          image:
            "https://wownature.in.ua/wp-content/uploads/2021/04/Mys-Dzharylhatskyy-Konstantin-Brizhnichenko.jpg",

          paragraphs: [
            "Національний природний парк “Джарилгацький” розташований у Херсонській області на межі з Кримом, адміністративний центр – у Скадовську. Парк був створений 1999 року для збереження природних та історико-культурних об’єктів Північного Причорномор’я.",
            "Острів Джарилгач – це по-справжньому дика й унікальна для України місцевість. Тут переважає степ, болотна, солонцева та солончакова рослинність. Острів слугує однією з основних баз для перелітних птахів у Європі (під час зимування їхня кількість перевищує 150 тис. особин). До Червоної книги України занесено 21 вид рослин і 110 видів тварин.",
            "На території Джарилгацького парку легко зустріти диких тварин: оленів, кабанів, муфлонів, єнотовидних собак. У прибережній зоні можна побачити дельфінів. З рукотворних об’єктів острова варто звернути увагу на старий маяк, зведений у 1902 році.",
            "Улітку острів Джарилгач приваблює туристів, які шукають певну екзотику. Тут безмежний простір з білосніжними пляжами й мало людей. Щодня зі Скадовська курсує пароплав, який привозить і забирає туристів. Останніми роками на Джарилгачі почали будувати приватні садиби для відпочинку.",
            "Джарилгацький національний природний парк – місце для справжніх романтиків. Багато сонця й білосніжного піску, гармонійне сусідство з дикими тваринами, неймовірні світанки з неповторним морським повітрям – усе це чекає на вас на Джарилгачі.",
          ],
        },
      },
      {
        id: 2,
        content: {
          region: "Херсонська",
          title: "Олешківські піски",
          image:
            "https://upload.wikimedia.org/wikipedia/commons/b/bd/Oleshkivski_sands.JPG",

          paragraphs: [
            "Національний природний парк “Олешківські піски” розташований у Херсонській області в пониззі річки Дніпро, а його адміністративний центр – у місті Олешки. Парк заснували у 2010 році для збереження й відтворення цінних природних та історично-культурних об’єктів краю.",
            "Олешківські піски – унікальний природний об’єкт для України та навіть Європи. Це єдиний в Україні піщаний масив такого масштабу протяжністю з півночі на південь близько 16 км, із заходу на схід майже 12 км.",
            "За температурним режимом і кількістю опадів територію національного парку відносять до напівпустель, хоч цю місцевість часто називають пустелею. Улітку пісок може нагріватися до 70 °C, а висота барханів сягає 5 м. Нерідко тут спостерігаються піщані бурі.",
            "Ландшафт парку дуже незвичайний. Більшу частину території займають піщані дюни, є штучні лісові насадження й поодинокі дерева, заболочені ділянки. У парку ви знайдете обладнані туристичні маршрути та оглядові вежі.",
            "Національний природний парк “Олешківські піски” – чудове місце для мандрівки на вихідні. Ви гарантовано побачите неймовірні пейзажі й найкращі заходи сонця, відчуєте єднання з природою та абсолютну свободу на безмежних просторах.",
          ],
        },
      },
    ],
    khmelnytskyi: [
      {
        id: 1,
        content: {
          region: "Хмельницька",
          title: "Мале Полісся",
          image:
            "https://upload.wikimedia.org/wikipedia/commons/1/14/%D0%A1%D0%B2%D1%8F%D1%82%D0%B5_%D0%BE%D0%B7%D0%B5%D1%80%D0%BE._1.jpg",

          paragraphs: [
            "Національний природний парк “Мале Полісся”, один із наймолодших в Україні, розташований у Славутському та Ізяславському районах Хмельницької області. Парк створений улітку 2013 року для збереження цінних природних комплексів та історико-культурних об’єктів східної частини Малого Полісся, що мають важливе природоохоронне, наукове, естетичне, рекреаційне й оздоровче значення.",
            "Територія національного парку охоплює значні лісові масиви, водно-болотні угіддя й долини річок Горинь, Вілія, Гнилий Ріг. Місцевість дуже мальовнича з цікавими ландшафтами та природними комплексами, притаманними Поліссю: рівнинність, підвищена зволоженість, піщані ґрунти та залісненість.",
            "Територією парку протікає одна з найдовших річок України – Горинь, що впадає у Прип’ять на території Білорусі. Одним із найцікавіших природних об’єктів є Святе озеро, яке лежить у лісовій гущавині.",
            "Біорізноманіття парку представлене досить широко, але потребує подальшого вивчення. Наразі виявлено чимало червонокнижних видів флори (15) та фауни (56). Велику частину хребетних тварин становлять птахи, яких тут налічується понад 200 видів. З рідкісних видів можна зустріти орлана-білохвоста, гоголя, скопу, змієїда, чорного лелеку та інших.",
            "Варті уваги також історичні пам’ятки, що збереглися на околицях національного парку: руїни палацу князів Санґушків і Новозаславського замку, залишки середньовічних мурів та валів, архітектурний комплекс костелу святого Йосифа середини XVIII сторіччя і бернардинський монастир, у якому зараз діє в’язниця.",
            "“Мале Полісся” – неймовірно затишне, сповнене природної краси місце. У парку чудово поєдналися ліси й луки, звивиста Горинь та унікальний історичний спадок.",
          ],
        },
      },
      {
        id: 2,
        content: {
          region: "Хмельницька",
          title: "Подільські товтри",
          image:
            "https://upload.wikimedia.org/wikipedia/commons/4/4f/%D0%9F%D0%BE%D0%B4%D1%96%D0%BB%D1%8C%D1%81%D1%8C%D0%BA%D1%96_%D1%82%D0%BE%D0%B2%D1%82%D1%80%D0%B8_1.jpg",

          paragraphs: [
            "Національний природний парк “Подільські Товтри” розташований у Хмельницькій області з адміністративним центром у Кам’янці-Подільському. Парк заснували в 1996 році для збереження та відтворення природних ландшафтів Поділля.",
            "Територія являє собою Товтровий кряж і каньйон Дністра з притоками. Товтри – це залишки давнього бар’єрного рифу Понтійського моря, що були утворені коралами та іншими організмами.",
            "У Подільських Товтрах ви побачите стрімкі урвища й каньйони, каскадні водоспади, залишки реліктових лісів, печери та багато іншого.",
            "Національний парк “Подільські Товтри” має величезний туристичний і рекреаційний потенціал. Велика площа і рельєф території сприяють різноманітності видів відпочинку. У Товтрах можна ходити в походи, сплавлятися Дністром, рибалити, кататися на велосипеді, займатися спелеотуризмом, літати на параплані, спостерігати за тваринами тощо. Фахівці виявили численні запаси природних мінеральних вод.",
            "У Подільських Товтрах досить велике біорізноманіття. Зокрема, тут налічується 145 червонокнижних видів (60 рослин і 85 тварин).",
            "До складу парку входить історична частина міста Кам’янець-Подільський, де збережено безліч архітектурних пам’яток. Щороку в місті відбувається низка історичних і тематичних заходів, які приваблюють туристів з усієї України і з-за кордону.",
          ],
        },
      },
    ],
    biosferni: [
      {
        id: 1,
        content: {
          region: "Біосферні",
          title: "Асканія Нова",
          image:
            "https://upload.wikimedia.org/wikipedia/commons/5/52/Przewalski%27s_Horse_Askania_Nova.jpg",

          paragraphs: [
            "Біосферний заповідник “Асканія-Нова” імені Ф. Е. Фальц-Фейна розташований на півдні Херсонщини. Його створив у далекому 1898 році німецький барон Фрідріх Фальц-Фейн як приватну природоохоронну територію з екзотичними тваринами. Відтоді Асканія пережила багато трансформацій. У 1983 році заповідник отримав статус біосферного, а в 1984-му ввійшов до мережі біосферних резерватів ЮНЕСКО.",
            "Асканія-Нова – це справжня перлина української природи, яка вже давно набула всесвітньої слави. В Асканії поєдналися цілинний таврійський степ і мрія людини створити щось надзвичайне. Тут зростають унікальні рослини, гніздяться рідкісні птахи та живуть тварини з різних континентів.",
            "Територія заповідника розділена на 3 частини: Північну, Південну та Великий Чапельський під. Останній являє собою природну низовину та є абсолютно заповідною територією, де вільно пасуться тварини. У степу можна побачити сайгаків, бізонів, коней Пржевальського, антилоп та інших рідкісних тварин. У поді росте велика кількість червонокнижних рослин, серед них і ендемік Асканії-Нової – рябчик шаховий.",
            "В Асканії можна відвідати один з найкращих дендропарків України, який функціонує завдяки складній зрошувальній системі, а також зоопарк та орнітопарк.",
            "У заповіднику успішно розводять і селекціонують тварин. Так, в Асканії з’явилося кілька нових порід овець. Заповідник регулярно продає рідкісних тварин для колекцій зоопарків за кордоном.",
            "Біосферний заповідник “Асканія-Нова” – унікальне явище не тільки для України, а й для всього світу. Це найбільший степовий заповідник Європи, який щороку відвідує близько 140 тисяч туристів.",
          ],
        },
      },
      {
        id: 2,
        content: {
          region: "Біосферні",
          title: "Карпатський",
          image:
            "https://upload.wikimedia.org/wikipedia/commons/a/ac/%D0%9A%D0%B0%D1%80%D0%BF%D0%B0%D1%82%D1%81%D1%8C%D0%BA%D0%B8%D0%B9_%D0%BD%D0%B0%D1%86%D1%96%D0%BE%D0%BD%D0%B0%D0%BB%D1%8C%D0%BD%D0%B8%D0%B9_%D0%BF%D1%80%D0%B8%D1%80%D0%BE%D0%B4%D0%BD%D0%B8%D0%B9_%D0%BF%D0%B0%D1%80%D0%BA_%28%D0%B1%D1%96%D0%BB%D1%8F_%D0%93%D0%BE%D0%B2%D0%B5%D1%80%D0%BB%D0%B8%29.jpg",

          paragraphs: [
            "Карпатський біосферний заповідник, один з найстаріших об’єктів природно-заповідного фонду України, входить до мережі біосферних резерватів ЮНЕСКО. Його заснували у 1968 році для збереження та відтворення унікальних ділянок дикої природи, захисту рідкісних видів флори й фауни. Адміністративний центр діє в місті Рахів.",
            "Територія заповідника включає 6 заповідних масивів у 4 районах Закарпатської області. Природа по-справжньому унікальна та багата. Заповідник охопив найцінніші природні ділянки, що збереглися практично незайманими до наших часів. Тут налічується понад 1000 видів вищих судинних рослин і близько 300 видів хребетних тварин. До Червоної книги України внесені 62 види рослин та 72 види тварин. Трапляються такі рідкісні тварини, як бурий ведмідь, рись, карпатський тритон, лісовий полоз, чорний лелека, пугач та інші.",
            "Заповідник відомий багатьма унікальними об’єктами: Долиною нарцисів, озером Бребенескул, горою Говерлою, музеями екології гір та історії природокористування Карпат. Уже більш ніж 20 років тут виходить екологічний журнал “Зелені Карпати”.",
            "Щороку заповідник відвідує велика кількість туристів, що призводить до рекреаційного перенавантаження та, як наслідок, знищення деяких видів і забруднення території. Особливо негативний вплив туристів помітний на Чорногірському масиві.",
            "Карпатський біосферний заповідник залишається унікальним куточком природи, збереження якої має глобальне міжнародне значення. Це чудове місце для знайомства з диким світом природи, традиціями карпатського регіону, активного відпочинку та оздоровлення.",
          ],
        },
      },
      {
        id: 3,
        content: {
          region: "Біосферні",
          title: "Чорнобильський",
          image:
            "https://lh3.googleusercontent.com/proxy/9UjLZ4rtONEbdlzPbOi8d3IoaeY5oZvwp-pA7xBdzwGZ3lBo9gEnQOGKw7lETit5pt9A3e_kVSlIFgLb9QA6YtnwMCf1-XrhPAfGoo8",

          paragraphs: [
            "Чорнобильський радіаційно-екологічний біосферний заповідник – єдина на сьогодні природоохоронна територія у світі, розташована в радіаційно забрудненому районі. Заповідник займає дві третини від усієї площі зони відчуження. Утворений у 2016 році для збереження флори та фауни Полісся, реабілітації забруднених радіонуклідами територій, стабілізації гідрологічного режиму, проведення наукових досліджень у галузі природи й екології. Адміністративний центр діє в смт Іванків.",
            "Через 30 років після аварії на ЧАЕС природа краю повністю відновила свій потенціал. Відсутність людини та будь-якої господарської діяльності сприяла відновленню популяцій рідкісних тварин, утворенню нових лісів. Зараз тут трапляється велика кількість червонокнижних видів: флори – 61, фауни – 66. З тварин постійними мешканцями є рись, вовк, зубр, лось, кінь Пржевальського, останнім часом можна зустріти бурого ведмедя.",
            "Природа Полісся завжди вабила людей красою та багатством. Сьогодні Чорнобильський заповідник є певним еталоном, де ця природа зберігається та охороняється від стороннього втручання.",
            "Чорнобильський радіаційно-екологічний біосферний заповідник – це справжня дика природа, що живе та розвивається всупереч усім викликам. Мальовничі Прип’ять і Дніпро, повні дичини ліси, абсолютна тиша та спокій – те, по що варто їхати до цих трагічних, але водночас казкових місць.",
          ],
        },
      },
      {
        id: 4,
        content: {
          region: "Біосферні",
          title: "Чорноморський",
          image:
            "https://ukrainaincognita.com/wp-content/uploads/files/chornomor7.jpg",

          paragraphs: [
            "Чорноморський біосферний заповідник розташований у Херсонській та частково Миколаївській областях. Його площа – 117 268 га. Території заповідника охоплюють північне узбережжя Чорного моря, деякі острови та довколишню акваторію.",
            "Заповідник було створено 14 липня 1927 року задля вивчення і збереження птахів. З роками його площа значно розширилась. Наразі територія заповідника складається з острівної, приморської та лісостепової ділянок, які знаходяться під охороною ЮНЕСКО.",
            "Установа підпорядковується Національній академії наук України. Фактично, заповідник використовується для наукових досліджень з максимальним обмеженням для відвідувачів.",
            "Флора і фауна Чорноморського біосферного заповідника є по справжньому унікальною та різноманітною. На території заповідника збереглись природні комплекси рослин крайнього півдня, багато з яких входять до Червоної книги України та Європейського червоного списку. Флора представлена значною кількістю видів водоростей та водних рослин, серед яких філофора жилиста, зостера морська та мала. Зустрічається багато ендемічних видів рослин: береза дініпровська, чебрець дніпровський, ковила дніпровська та інші.",
            "Окрім цього, на території заповідника ростуть понад 700 видів вищих судинних рослин, 90 видів лишайників, 87 видів шапкових грибів, 61 вид мохів. Багато видів рослин ще чекають на облік, адже не вся територія заповідника ретельно досліджена.",
            "Чорноморський заповідник відіграє важливу роль у збереженні чисельних видів птахів. Багато з них можна зустріти тут у період міграції. Загалом заповідник є домівкою для 110 видів, які тут гніздяться, наприклад для пісочника морського, дрохви, мартина каспійського, пелікана рожевого, пухівки та багатьох інших. Загальна ж чисельність пернатих складає понад 300 видів.",
            "У цілому фауна заповідника складає близько 3500 видів, більшість з яких представлені різноманіттям комах – 2200 видів. Серед риб у акваторії заповідника мешкають 83 види – орієнтовно 50 % усього видового складу Чорного моря. Ссавці представлені 50 видами серед яких є і червонокнижні: борсук, видра річкова, тюлень-монах, мишівка степова та дельфін.",
            "Чорноморський біосферний заповідник – це по справжньому унікальне місце з майже 100-літньою історією природоохоронних традицій. Тисячі птахів, блакить моря, свіже повітря та дикі піщані пляжі зачарують вас назавжди.",
          ],
        },
      },
    ],
    pryrodni: [
      {
        id: 1,
        content: {
          region: "Природні",
          title: "Канівський",
          image:
            "https://upload.wikimedia.org/wikipedia/commons/thumb/2/22/%D0%9A%D0%B0%D0%BD%D1%96%D0%B2%D1%81%D1%8C%D0%BA%D0%B8%D0%B9_%D0%BF%D1%80%D0%B8%D1%80%D0%BE%D0%B4%D0%BD%D0%B8%D0%B9_%D0%B7%D0%B0%D0%BF%D0%BE%D0%B2%D1%96%D0%B4%D0%BD%D0%B8%D0%BA._%D0%9A%D1%80%D0%B0%D1%94%D0%B2%D0%B8%D0%B4_%D0%B7_%D0%A7%D0%B5%D1%80%D0%BD%D0%B5%D1%87%D0%BE%D1%97_%D0%B3%D0%BE%D1%80%D0%B8.jpg/800px-%D0%9A%D0%B0%D0%BD%D1%96%D0%B2%D1%81%D1%8C%D0%BA%D0%B8%D0%B9_%D0%BF%D1%80%D0%B8%D1%80%D0%BE%D0%B4%D0%BD%D0%B8%D0%B9_%D0%B7%D0%B0%D0%BF%D0%BE%D0%B2%D1%96%D0%B4%D0%BD%D0%B8%D0%BA._%D0%9A%D1%80%D0%B0%D1%94%D0%B2%D0%B8%D0%B4_%D0%B7_%D0%A7%D0%B5%D1%80%D0%BD%D0%B5%D1%87%D0%BE%D1%97_%D0%B3%D0%BE%D1%80%D0%B8.jpg",

          paragraphs: [
            "Поблизу Канева у Черкаській області лежить один з найстаріших заповідників України – Канівський природний заповідник, заснований 30 липня 1923 року.",
            "Площа природного заповідника складає 2027 гектарів. Колись територія Канівського заповідника була вкрита густими дубовими лісами, проте через надмірне вирубування дерев, яке викликало сильну ерозію ґрунтів, сьогодні третину території займають яри, а основною породою дерев замість дуба став граб. Рослинний світ заповідника нараховує близько 990 видів, що складає 20 % загальної флори України. На цих землях ростуть такі унікальні види, як підсніжник звичайний, цибуля ведмежа, ранник весняний тощо.",
            "Унікальною та багатою є також фауна Канівського природного заповідника. Відвідуючи природні зони, можна натрапити на кабанів, лисиць, зайців, лосів, борсуків. Зустрічаються такі земноводні, як ропуха сіра, тритон, квакша, часничниця.",
            "Заповідник є важливим пунктом для відпочинку птахів під час перельотів, тому восени можна побачити зграї мартинів і качок. Окрім цих видів, можна зустріти велику кількість білих чапель, лелек та орланів-білохвостів.",
            "Природа Канівського заповідника є домом для більш ніж 10 тисяч видів безхребетних тварин, багато з яких занесені до Червоної книги України, як, наприклад, жук-олень, джміль моховий, махаон, ктир гігантський, бражник мертва голова та інші.",
            "Канівський природний заповідник має багату як природну, так і історичну спадщину. Тут виявлені та перебувають під охороною скіфські городища й поселення полян, а також городище давньоруського міста Родень, датоване IX–XIII століттями.",
            "Місцева природа поєднала в собі лісисті пагорби та глибокі води Дніпра, степову рослинність і заболочені ділянки, популярні туристичні місця та, навпаки, ізольовані заплавні острови. Колорит і приголомшливі краєвиди з дніпровських круч точно зачарують вас своєю красою.",
          ],
        },
      },
      {
        id: 2,
        content: {
          region: "Природні",
          title: "Поліський",
          image:
            "https://lh3.googleusercontent.com/proxy/tFAwiMo2QzyM3XkOFAZ0O6BBw6OafZUmoD1ABqkNiS_wpUccONM--PpflQd52JXk6uQl0HywHlpQUUAwBkB5tDnWjavBqHCM2-q-vaFMtP1x9xU",

          paragraphs: [
            "Поліський природний заповідник розташований у північній частині Житомирської області на кордоні з Білоруссю, а на заході межує з Рівненською областю. Був створений у 1968 році з метою збереження та відтворення типових для Полісся природних комплексів.",
            "Поліський заповідник – це справжній острівець дикої природи. Тут час минає неквапливо, а природа є справжнім господарем краю. Завдяки віддаленому географічному розташуванню та заболоченій місцевості територія не зазнала інтенсивного впливу господарської діяльності.",
            "Серед ландшафтів переважають соснові ліси з густим шаром моху та лишайників, а також сфагнові болота. Заболочені ліси включені до Смарагдової мережі Європи. Трапляється багато типових тайгових видів рослин і тварин.",
            "Звичними видами тварин Поліського заповідника є козуля, лось, кабан, лисиця, заєць. З червонокнижних та рідкісних видів: рись, вовк, річкова видра, чорний лелека, сірий журавель.",
            "Біля села Селезівка є 30-метрова оглядова вежа, звідки відкривається чудовий панорамний краєвид села та лісового масиву. На території заповідника діє музей «Древлянське село», обладнані екостежки та маршрути, створені реконструкції зимового куреня й партизанської землянки. У заповіднику можна орендувати житло (класичну зрубну хату з піччю або дерев’яний будиночок).",
            "Поліський природний заповідник – чудове місце для спокійного відпочинку на лоні природи. Тут ідеальна тиша, свіже повітря, спів пташок, багато грибів та ягід, а головне – немає інтернету.",
          ],
        },
      },
      {
        id: 3,
        content: {
          region: "Природні",
          title: "Рівненський",
          image:
            "https://upload.wikimedia.org/wikipedia/commons/2/23/%D0%A0%D1%96%D0%B2%D0%BD%D0%B5%D0%BD%D1%81%D1%8C%D0%BA%D0%B8%D0%B9_%D0%9F%D1%80%D0%B8%D1%80%D0%BE%D0%B4%D0%BD%D0%B8%D0%B9_%D0%97%D0%B0%D0%BF%D0%BE%D0%B2%D1%96%D0%B4%D0%BD%D0%BA.jpg",

          paragraphs: [
            "Рівненський природний заповідник, один з найбільших в Україні, розкинувся  в межах відразу 5 районів Рівненської області. Заснований 3 квітня 1999 року Указом Президента України для збереження типових та унікальних природних комплексів Полісся.",
            "До складу заповідника входять 4 заказники: ландшафтний «Білоозерський», загальнозоологічний «Перебродівський», ботанічний «Сира Погоня» та гідрологічний «Сомине».",
            "У Рівненському природному заповіднику представлені болота всіх типів, які трапляються на Українському Поліссі. Найбільшою різноманітністю характеризується Білоозерська ділянка, на якій поширені низинні болота та болота перехідного типу. На решті ділянок переважають сфагнові болота. Справжньою родзинкою заповідника є озеро Біле, яке ще часто називають перлиною Українського Полісся. Вода в ньому надзвичайно чиста і прозора. Середня глибина озера становить 10 м, а найглибша ділянка – 34 метри.",
            "Різноманітним є рослинний світ заповідника, що налічує понад 500 видів вищих судинних рослин, 150 видів мохоподібних, більш ніж 100 видів грибів. Багато видів занесені до Червоної книги України та міжнародних охоронних списків. На території заповідника можна побачити осоку дводомну, вербу лапландську, росичку середню й англійську, вербу чорничну та інші рослини.",
            "Фауна заповідника не менш унікальна. Вона нараховує 221 вид хребетних тварин. З них 25 видів занесені до Червоної книги України, 7 – до Європейського Червоного списку, 124 підлягають особливій охороні згідно з Бернською конвенцією. Тут можна зустріти вовка, лисицю звичайну, ласку та горностая, рись, лелеку чорного, борсука, черепаху болотну, мідянку та багатьох інших тварин.",
            "Рівненський природний заповідник – це приголомшлива велика територія з рідкісною флорою та фауною. Сюди варто їхати як для активного відпочинку, так і для спокійного спостереження за дикою природою, екологічного просвітництва.",
          ],
        },
      },
    ],
  };

  // Check if label and id are valid
  if (regionsData[label] && regionsData[label][id - 1]) {
    return regionsData[label][id - 1];
  } else {
    return null;
  }
}
