export default function handler(req, res) {
  const { label } = req.query;

  const data = fetchData(label);

  // Check if data exists
  if (data) {
    res.status(200).json(data);
  } else {
    res.status(404).json({ error: "Data not found" });
  }
}

function fetchData(label) {
  const regionsData = {
    zakarpattia: [
      {
        content: {
          region: "Запоріжжя",

          title: "Національні парки Волинської області",
          paragraphs: [
            "Закарпаття – це один з найпопулярніших туристичних регіонів України. Тут змішалося багато культур, а кількість мов і діалектів найбільша в Україні. Це й не дивно, адже область межує відразу з 4 державами. Закарпаття славиться своїми мінеральними водами, смачною кухнею, цікавою архітектурою та винами.",
            "Проте головною цінністю Закарпаття є природа, а саме Карпатські гори й ліси. У регіоні зосереджено 4 великі об’єкти природно-заповідного фонду, 3 національні парки та один біосферний заповідник.",
          ],
        },
      },
    ],
    volyn: [
      {
        content: {
          region: "Волинь",

          title: "Парки та заповідники Закарпатської області",
          paragraphs: [
            "Волинська область лежить у зоні Північно-Західного Полісся, де зосереджені унікальні екосистеми й ландшафти. Цей регіон дуже зволожений і лісистий, з низкою озер, річок та боліт. Крім того, регіон має надзвичайну етнографічну й культурно-історичну цінність.",
            ,
            "На Волині розташовані 3 національні парки та один заповідник. Безперечно, найвідомішим об’єктом є Шацький національний парк, або так звані Шацькі озера. Сюди щороку приїздить численна армія туристів з різних регіонів України та з-за кордону.",
          ],
        },
      },
    ],

    ivano_frankivsk: [
      {
        content: {
          region: "Івано-Франківськ",

          title: "Національні парки та заповідники Івано-Франківської області",
          paragraphs: [
            "Івано-Франківщина справедливо вважається туристичним і “зеленим” регіоном. Тут і на Херсонщині зосереджена найбільша кількість національних природних парків в Україні (по 5) та один природний заповідник. В області розташований один з найпопулярніших і найвідвідуваніших парків – Карпатський. Регіон має надзвичайно мальовничу природу й буквально переповнений історично-культурними й етнографічними пам’ятками.",
          ],
        },
      },
    ],
    kyiv: [
      {
        content: {
          region: "Київ",

          title: "Національні парки та заповідники Київської області",
          paragraphs: [
         "Природно-заповідний фонд Київщини по-справжньому унікальний. Тут розташований єдиний у світі радіаційно-біологічний біосферний заповідник (Чорнобильський) і єдиний в Україні національний парк, що лежить у межах мегаполісу (Голосіївський). Самі об’єкти репрезентують природу Північного Полісся й частково Наддніпрянщини. Однак разом з цим у Київській області є суттєві проблеми з функціонуванням заповідної справи. Відразу 2 національні парки (Білоозерський і Залісся) формуються вже понад 10 років, хоч укази про їхнє створення підписали ще у грудні 2009 року."
            
          ],
        },
      },
    ],
    lviv: [
      {
        content: {
          region: "Львів",

          title: "Національні парки та заповідники Львівської області",
          paragraphs: [
          "Львівщина – це туристичний регіон з багатою природою, великим історичним і культурним спадком. Наразі в області нараховується 5 національних парків та один природний заповідник. У листопаді 2020 року в Старосамбірському районі створили національний парк “Королівські Бескиди”. Він став наймолодшим парком в Україні. Загалом до природно-заповідного фонду області належать 349 об’єктів.",
          ],
        },
      },
    ],
    odesa: [
      {
        content: {
          region: "Одеса",

          title: "Національні парки та заповідники Одеської області",
          paragraphs: [
"Одещина – це колоритний південний край України з унікальними природними комплексами та культурно-історичними багатствами. Регіон розташований на узбережжі Чорного моря, тут чудова природа і своєрідний клімат.",
            "Природно-заповідний фонд Одеської області включає один біосферний заповідник, по 2 національні й регіональні ландшафтні парки, а також низку заказників і пам’яток природи.",
          ],
        },
      },
    ],

    kherson: [
      {
        content: {
          region: "Херсон",

          title: "Природні парки та заповідники Херсонської області",
          paragraphs: [
            "Херсонська земля по-справжньому багата на природні пам’ятки й туристичні принади. Регіон є одним із 3 рекордсменів природно-заповідного фонду України. Тут налічується 2 біосферні заповідники та 5 національних парків.",
            "Найвідоміший об’єкт Херсонщини – біосферний заповідник “Асканія-Нова”, що має світову славу й понад сторічну історію. Тут розташований найбільший острів Чорного моря (Джарилгач) і найбільша напівпустеля Європи (Олешківські піски).",
          ],
        },
      },
    ],

    biosferni: [
      {
        content: {
          region: "Біосферні",

          title: "Біосферні заповідники в Україні",
          paragraphs: [
            "Біосферний заповідник – одна з категорій природно-заповідного фонду України, установа міжнародного значення, що займається природоохоронною та науково-дослідною діяльністю.",
            "Завданнями біосферних заповідників є збереження типових природних комплексів біосфери, екологічний моніторинг, вивчення навколишнього природного середовища та його змін під антропогенним впливом. Головною відмінністю від природних заповідників та інших природоохоронних територій є міжнародний формат природоохоронної та наукової діяльності.",
          ],
        },
      },
    ],
    pryrodni: [
      {
        content: {
          region: "Природні",

          title: "Природні заповідники в Україні",
          paragraphs: [
            "Природний заповідник – одна з категорій природно-заповідного фонду України (колишня назва – “державний заповідник”). Це установа, що має природоохоронний і науково-дослідний статус загальнодержавного значення.",
            "Природні заповідники створюються і діють для збереження в первинному стані природних комплексів та об’єктів певних територій, дослідження природних процесів усередині них, оцінювання впливу та змін навколишнього природного середовища, сталого використання природних ресурсів тощо.",
            "В Україні нараховується 19 природних заповідників, що охоплюють території 12 областей та АР Крим. Найбільша кількість природних заповідників розташована в Криму (6).",
          ],
        },
      },
    ],
  };
  if (regionsData[label]) {
    return regionsData[label];
  } else {
    return null;
  }
}
